Table of Contents
 Enum TwoWaySlabType
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Two way slab types
public enum TwoWaySlabType
Fields
DeepBeam = 2
wall model - only membrane forces - detailing for deep beam
ShellAsPlate = 3
shell model - all forces - detailing for slab
ShellAsWall = 4
shell model - all forces - detailing for wall
Slab = 0
slab model - only bending forces + shell
Wall = 1
wall model - only membrane forces
Fields
 Name |  Description
 DeepBeam = 2
wall model - only membrane forces - detailing for deep beam
 ShellAsPlate = 3
shell model - all forces - detailing for slab
 ShellAsWall = 4
shell model - all forces - detailing for wall
 Slab = 0
slab model - only bending forces + shell
 Wall = 1
wall model - only membrane forces
 Edit this page